// Task - 1 (Сделайте функцию, которая возвращает квадрат числа. Число передается параметром.)
function mul(a, b) {
    return a * 2;
}
console.log(mul(3));

// Task - 2 (Сделайте функцию, которая возвращает сумму двух чисел.)
function sum(a, b) {
    return a + b;
}
console.log(sum(3, 7));

// Task - 3 (Сделайте функцию, которая отнимает от первого числа второе и делит на третье.)
function calc(a, b, c) {
    return (a - b) / c;
}
console.log(calc(10, 4, 2));

// Task - 4 (Сделайте функцию, которая принимает параметром число от 1 до 7, а возвращает день недели на русском языке.)
function week(a) {
    if (a == 1) {
        return 'Mon'
    }   else if (a == 2) {
        return ''
    }
}